spring-boot-restapi-consume-soapservice/soap-ws-jpa-crud/src/test/resources/requests/GetAllEmployeeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://www.tech.vision.com/soap/employees">
   <soapenv:Header/>
   <soapenv:Body>
      <emp:GetAllEmployeeRequest/>
   </soapenv:Body>
</soapenv:Envelope>